let x = 10 + 5; //15
let y = 10 - 5; //5
let z = 10 * 5; //50
let q = 10 / 5; //2
let w = 10 % 3; //1

let complex = 10 + 5 * 10 - 8 / 2; //56
let complex2 = (10 + 5) * (10 - 8)  / 2; //15

let a = 10; 
// Postfix, или Постфиксная форма
a++; //11 инкремент
a--; //10 декремент 
// Prefix, или Префиксная форма
++a; //11 инкремент
--a; //10 декремент

console.log(a++); // 10
console.log(a); // 11
console.log(a--); // 11
console.log(a); // 10


// Присвоение с опреацией (когда операция над единственной переменной)
x += 5; // x = x + 5
x -= 5;
x *= 3;
x /= 4;
x %= 5; 